ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/scalability/bpels/PendStatusVarsPassivation/prj1Jbi/src/jbiasa/prj1Jbi.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="prj1Jbi"
             xmlns:tns="prj1Jbi" xmlns:ns="http://j2ee.netbeans.org/wsdl/FunctionalTest1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/FunctionalTest1" location="../jbiServiceUnits/prj2Bpel/FunctionalTest1.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:portType1">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="FunctionalTest1Operation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns:portType2">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="FunctionalTest1Operation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="receivePort" binding="tns:casaBinding1">
            <soap:address location="http://localhost:18181/service"/>
        </port>
    </service>
    <service name="casaService2">
        <port name="invokePort" binding="tns:casaBinding2">
            <soap:address location="http://localhost:18181/service"/>
        </port>
    </service>
</definitions>
