ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/scalability/bpels/PendStatusVarsPassivation/prj1Jbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prj="prj1Jbi">
  <soapenv:Body>
    <prj:FunctionalTest1Operation>
      <part1>Input Message</part1>
    </prj:FunctionalTest1Operation>
  </soapenv:Body>
</soapenv:Envelope>